{
  "jurisdiction": "NG",
  "title": "Constitution of the Federal Republic of Nigeria",
  "version": "1999 (as amended)",
  "parts": [
    {
      "id": "part1",
      "title": "Part I",
      "chapters": [
        {
          "id": "chap4",
          "title": "Chapter IV - Fundamental Rights",
          "sections": [
            {
              "id": "s33",
              "number": "33",
              "marginal_title": "Right to life",
              "text": "(1) Every person has a right to life, and no one shall be deprived intentionally of his life, save in execution of the sentence of a court in respect of a criminal offence of which he has been found guilty in Nigeria.\n(2) A person shall not be regarded as having been deprived of his life in contravention of this section, if he dies as a result of the use, to such extent and in such circumstances as are permitted by law, of such force as is reasonably necessary -\n(a) for the defence of any person from unlawful violence or for the defence of property:\n(b) in order to effect a lawful arrest or to prevent the escape of a person lawfully detained; or\n(c) for the purpose of suppressing a riot, insurrection or mutiny.",
              "keywords": ["life", "fundamental rights"],
              "notes": ""
            },
            {
              "id": "s34",
              "number": "34",
              "marginal_title": "Dignity of human person",
              "text": "(1) Every individual is entitled to respect for the dignity of his person, and accordingly -\n(a) no person shall be subject to torture or to inhuman or degrading treatment;\n(b) no person shall be held in slavery or servitude; and\n(c) no person shall be required to perform forced of compulsory labour.\n(2) for the purposes of subsection (1) (c) of this section, \"forced or compulsory labour\" does not include -\n(a) any labour required in consequence of the sentence or order of a court;\n(b) any labour required of members of the armed forces of the Federation or the Nigeria Police Force in pursuance of their duties as such;\n(c) in the case of persons who have conscientious objections to service in the armed forces of the Federation, any labour required instead of such service;\n(d) any labour required which is reasonably necessary in the event of any emergency or calamity threatening the life or well-being of the community; or\n(e) any labour or service that forms part of -\n(i) normal communal or other civic obligations of the well-being of the community.\n(ii) such compulsory national service in the armed forces of the Federation as may be prescribed by an Act of the National Assembly, or\n(iii) such compulsory national service which forms part of the education and training of citizens of Nigeria as may be prescribed by an Act of the National Assembly.",
              "keywords": ["dignity", "torture"],
              "notes": ""
            },
            {
              "id": "s35",
              "number": "35",
              "marginal_title": "Personal liberty",
              "text": "(1) Every person shall be entitled to his personal liberty and no person shall be deprived of such liberty save in the following cases and in accordance with a procedure permitted by law -\n(a) in execution of the sentence or order of a court in respect of a criminal offence of which he has been found guilty;\n(b) by reason of his failure to comply with the order of a court or in order to secure the fulfilment of any obligation imposed upon him by law;\n(c) for the purpose of bringing him before a court in execution of the order of a court or upon reasonable suspicion of his having committed a criminal offence, or to such extent as may be reasonably necessary to prevent his committing a criminal offence;\n(d) in the case of a person who has not attained the age of eighteen years for the purpose of his education or welfare;\n(e) in the case of persons suffering from infectious or contagious disease, persons of unsound mind, persons addicted to drugs or alcohol or vagrants, for the purpose of their care or treatment or the protection of the community; or\n(f) for the purpose of preventing the unlawful entry of any person into Nigeria or of effecting the expulsion, extradition or other lawful removal from Nigeria of any person or the taking of proceedings relating thereto: Provided that a person who is charged with an offence and who has been detained in lawful custody awaiting trial shall not continue to be kept in such detention for a period longer than the maximum period of imprisonment prescribed for the offence.\n(2) Any person who is arrested or detained shall have the right to remain silent or avoid answering any question until after consultation with a legal practitioner or any other person of his own choice.\n(3) Any person who is arrested or detained shall be informed in writing within twenty-four hours (and in a language that he understands) of the facts and grounds for his arrest or detention.\n(4) Any person who is arrested or detained in accordance with subsection (1) (c) of this section shall be brought before a court of law within a reasonable time, and if he is not tried within a period of -\n(a) two months from the date of his arrest or detention in the case of a person who is in custody or is not entitled to bail; or\n(b) three months from the date of his arrest or detention in the case of a person who has been released on bail, he shall (without prejudice to any further proceedings that may be brought against him) be released either unconditionally or upon such conditions as are reasonably necessary to ensure that he appears for trial at a later date.\n(5) In subsection (4) of this section, the expression \"a reasonable time\" means -\n(a) in the case of an arrest or detention in any place where there is a court of competent jurisdiction within a radius of forty kilometres, a period of one day; and\n(b) in any other case, a period of two days or such longer period as in the circumstances may be considered by the court to be reasonable.\n(6) Any person who is unlawfully arrested or detained shall be entitled to compensation and public apology from the appropriate authority or person; and in this subsection, \"the appropriate authority or person\" means an authority or person specified by law.\n(7) Nothing in this section shall be construed -\n(a) in relation to subsection (4) of this section, as applying in the case of a person arrested or detained upon reasonable suspicion of having committed a capital offence; and\n(b) as invalidating any law by reason only that it authorises the detention for a period not exceeding three months of a member of the armed forces of the federation or a member of the Nigeria Police Force in execution of a sentence imposed by an officer of the armed forces of the Federation or of the Nigeria police force, in respect of an offence punishable by such detention of which he has been found guilty.",
              "keywords": ["liberty"],
              "notes": ""
            },
            {
              "id": "s36",
              "number": "36",
              "marginal_title": "Fair hearing",
              "text": "Seed text — replace with actual. In the determination of civil rights and obligations, a person shall be entitled to a fair hearing.",
              "keywords": ["fair hearing"],
              "notes": ""
            }
          ]
        }
      ]
    }
  ]
}
